import { IProject } from 'types/project';
import { ITheaterInfo } from 'types/theater';
import { IContactInfo } from 'types/contacts';

export const mockProjects: IProject[] = [
    {
        id: '10',
        name: 'Театральная лаборатория',
        slug: 'theatre-lab',
        description: 'Экспериментальная театральная лаборатория для молодых режиссеров и драматургов...',
        images: ['/img/mockImage.jpg', '/img/mockImage.jpg', '/img/mockImage.jpg'],
        buttonText: 'Подробнее',
        buttonLink: 'https://afisha.yandex.ru/yekaterinburg',
    },
    {
        id: '11',
        name: 'Детская театральная школа',
        slug: 'kids-theatre-school',
        description: 'Образовательный проект для детей, включающий занятия по актерскому мастерству...',
        images: ['/img/mockImage.jpg', '/img/mockImage.jpg'],
        buttonText: 'Регистрация',
        buttonLink: 'https://afisha.yandex.ru/yekaterinburg',
    },
    {
        id: '12',
        name: 'Театральный фестиваль',
        slug: 'theatre-festival',
        description: 'Ежегодный фестиваль современного театрального искусства...',
        images: ['/img/mockImage.jpg'],
        buttonText: 'Купить билет',
        buttonLink: 'https://afisha.yandex.ru/yekaterinburg',
    },
];

export const mockTheaterInfo: ITheaterInfo = {
    image: '/img/theater-photo.jpg',
    description: `Центр Современной Драматургии — это новый формат театра. Здесь нет привычной классики, огромного зала, бархатного занавеса и биноклей.

В ЦСД зал рассчитан всего на 63 человека, а действие спектакля разворачивается на расстоянии вытянутой руки. Вы максимально погрузитесь во все происходящее на сцене, не упустите ни одну деталь.Четвертая стена рушится сама собой, когда актеры буквально смотрят тебе в глаза!

ЦСД — это площадка для экспериментов, в которой нет правил и цензуры. Это театр, который создают молодые уральские режиссеры, драматурги, актеры, музыканты и художники. Наше новаторство проявляется даже в расположении: мы находимся в уютном лофт-пространстве «Рыбзавода».

ЦСД — это место, которое хотя бы раз в жизни должен посетить каждый житель или гость Екатеринбурга. Это место, в котором вы испытаете живые эмоции. Это место, которое не оставит равнодушным никого.`,
    partnersImages: ['/img/partners/mockImage.png', '/img/partners/mockImage.png', '/img/partners/mockImage.png'],
};

export const mockContactInfo: IContactInfo = {
    address:
        '620000 Россия, Свердловская область, г. Екатеринбург, ул. Малышева, д. 145А, лит.Ф пространство бывшего «Рыбзавода»',
    workingDaysText: 'Со вторника по воскресенье',
    workingHours: {
        start: '11:00',
        end: '20:00',
    },
    daysOff: ['Понедельник'],
    phones: {
        main: '+7 (996) 170-24-20',
        boxOffice: '+7 (343) 206-69-12',
    },
    email: 'dramcentr@gmail.com',
    faq: [
        {
            question: 'Как купить билет?',
            answer: `- На нашем сайте
Мы работаем с билетной системой Яндекс.Билеты
Нажать кнопку «Купить билеты» в разделе «Афиша» или на странице конкретного спектакля;
Выбрать понравившиеся места;
Нажать кнопку «Купить». Выбрать способ оплаты, ввести данные банковской карты и актуальный адрес электронной почты;
Готово! Билеты уже на Вашей почте. Их можно показать на входе с экрана мобильного телефона или распечатать.
- В кассе ЦСД на Малышева, 145А, лит.Ф
В нашей кассе можно купить любое свободное место в зале.`,
        },
        {
            question: 'Как до вас добраться?',
            answer: `- На общественном транспорте
Доехать до остановки «Комсомольская», далее пешком 400 м по нечетной стороне улицы Малышева в сторону ЖБИ, перейти улицу Студенческую и двигаться вдоль моста до здания с вывеской «ТЕАТР ЦСД», вход находится с правого торца, первая дверь с табличкой «ЦСД», 2 этаж
- На автомобиле
Со стороны центра города двигаться по улице Малышева, развернуться под мостом (не заезжая на него). Парковка находится у цветного забора перед зданием с вывеской «ТЕАТР ЦСД».`,
        },
        {
            question: 'Как вы работаете?',
            answer: 'Касса работает с 11 до 20 часов со вторника по воскресенье, понедельник - выходной день. Мы играем спектакли каждый день.',
        },
    ],
};
